#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(СсылкаНаСтандарт, ПараметрыВыполненияКоманды)
	
	Если ЭтоГруппаСтандартов(СсылкаНаСтандарт) Тогда
		ПредупреждениеАсинх(НСтр("ru='Недоступно для группы стандартов.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("СтандартРазработки", СсылкаНаСтандарт);
	ОткрытьФорму(
		"ОбщаяФорма.РедакторHTML",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		СсылкаНаСтандарт,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтоГруппаСтандартов(Стандарт)
	
	Возврат Стандарт.ЭтоГРуппа;
	
КонецФункции

#КонецОбласти