#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(СтандартРазработки, ПараметрыВыполненияКоманды)
	
	Если ЭтоГруппаСтандартов(СтандартРазработки) Тогда
		ПредупреждениеАсинх(НСтр("ru='Недоступно для группы стандартов.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("СтандартРазработки", СтандартРазработки);
	ОткрытьФорму(
		"ОбщаяФорма.РедакторHTML",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		СтандартРазработки,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтоГруппаСтандартов(Знач СтандартРазработки)
	
	Возврат Справочники.СтандартыРазработки.ЭтоГруппаСтандартов(СтандартРазработки);
	
КонецФункции

#КонецОбласти