#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеСодержимогоСтандарта" Тогда
		Прочитать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СодержаниеСтандартаHTMLНаФормеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ (ДанныеСобытия.Свойство("href") И ЗначениеЗаполнено(ДанныеСобытия.href)) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаСтандартИТС = РаботаСHTMLКлиентСервер.СсылкаНаИТС(ДанныеСобытия.href);
	
	ЗапуститьПриложениеАсинх(СсылкаНаСтандартИТС);
	
КонецПроцедуры

#КонецОбласти