#Область ПрограммныйИнтерфейс

Функция НачальнаяСтраница() Экспорт
	
	ОткрытыеОкна = ПолучитьОкна();
	
	НачальнаяСтраница = Неопределено;
	Для Каждого КлиентскоеОкно Из ОткрытыеОкна Цикл
		
		Если КлиентскоеОкно.НачальнаяСтраница Тогда
			НачальнаяСтраница = КлиентскоеОкно;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НачальнаяСтраница;
	
КонецФункции

Функция ФормаПросмотраСтандартов(Окно) Экспорт
	
	ФормаСоСтандартами = Неопределено;
	
	Если Окно = Неопределено Тогда
		Возврат ФормаСоСтандартами
	КонецЕсли;
	
	Для Каждого Форма Из Окно.Содержимое Цикл
		Если Форма.ИмяФормы = "Справочник.СтандартыРазработки.Форма.ФормаСпискаСПросмотром" Тогда
			ФормаСоСтандартами = Форма;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ФормаСоСтандартами;
	
КонецФункции

#КонецОбласти
