#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьСодержаниеСтандарта(СодержаниеСтандартаХТМЛ) Экспорт
	
	СодержаниеСтандартаHTML = СодержаниеСтандартаХТМЛ;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	// Это должно выполняться всегда
	Если Не ЭтоГруппа Тогда
		СодержаниеСтандартаТекст = РаботаСHTMLКлиентСервер.ТекстИзHTML(СодержаниеСтандартаHTML);
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
